from context.Context import VideoParameter
from llm.llm_client import get_llm_client
from service.main_process import generate_video

text ="""
组成威尼斯的群岛位于亚得里亚海的最北边。在中世纪，威尼斯可能是世界上最富裕的地方，拥有最先进的广纳式经济制度，这些制度则由初始的广纳式政治支撑。威尼斯在公元810年获得独立，于今看来恰好在一个幸运时刻。欧洲的经济正从罗马帝国崩溃带来的衰退逐渐复苏，查理曼等君王重新建构强大的集权政治势力。这带来稳定和更多安全，以及贸易的扩增，而威尼斯则处于最具优势的独特地位。这是一个航海家的王国，位在地中海的中段，有来自东方的香料、拜占庭制造的产品以及奴隶，威尼斯因而变得富裕。到1050年，威尼斯的经济扩张至少已经一个世纪，人口达到四万五千人。到1200年，人口增加了50%，达到七万人；到1330年，又再增加50%到十一万人。当时的威尼斯已和巴黎一样大，同时可能是伦敦人口规模的三倍。
威尼斯经济扩张的关键基础之一是，一连串的契约创新让经济制度变得更具广纳性。最著名的是康曼达（commenda），是一种初具雏形的合股公司，只在单一一次贸易任务期间组成。康曼达涉及两批合伙人，一批是留在威尼斯的“定居”方，另一批则是旅行者。定居的合伙人投入资金到合伙事业，旅行的合伙人则与货物随行。通常定居的合伙人提供绝大部分的资本；年轻的创业家本身没有足够财力，可以通过押运商品旅行跨入贸易事业。这是向上流社会流动的重要渠道。旅途中的任何损失按照合伙人出资比率分担。如果商旅赚钱，获利则按两类康曼达契约分配。如果康曼达是单方出资的，那么定居的商人提供100%的资本，并得到75%的获利。如果是两方出资的，定居的商人提供67%的资本，并取得50%的获利。研究官方文件就可看出，康曼达是提高向上流社会流动的强大力量；这类文件上记载许多新名字，都是原本不属于威尼斯菁英阶层的人。在公元960年、971年和982年的政府文件中，出现的新名字分别占记载的69%、81%和65%。
这种经济广纳性和新家族通过贸易崛起，迫使政治制度变得更开放。管理威尼斯的总督由公民大会选出，终身任职。公民大会虽然是所有公民出席的会议，实际上则由一群最有影响力的核心家族主导。虽然总督权力很大，但他的权力随着政治制度改变而减弱。1032年以后，总督改由
 
新创立的总督委员会遴选，总督委员会的工作也包括确保总督不拥有绝对的权力。第一个被总督委员会选出的总督是一位富有的丝绸商人，来自未曾居于高位的家族。这个制度变革发生后，威尼斯的商务和海军势力开始大幅扩张。1082年，威尼斯在君士坦丁堡取得广泛的贸易优惠，并在该地建立一个威尼斯区。那里很快就住了一万名威尼斯人。我们从这里可以看出广纳式经济和政治制度开始携手并进。
威尼斯的经济扩张为政治变革带来更大的压力，而1171年总督遭谋杀后的政治与经济制度改变，更使经济扩张突飞猛进。第一个重要的创新是设立大会议（Great Council），是此后威尼斯政治权力的最终来源。大会议是由威尼斯国的公职人员如法官等组成，并由贵族主导。除了这些公职官员外，每年由一个提名委员会提名一百位新成员给大会议，提名委员会有四名成员，从既有的大会议抽签选出。大会议产生后，也遴选两个次级会议的成员，即参议会（Senate）和四十人会议（Council of Forty），两个会议各有不同的立法和行政职责。大会议也挑选总督委员会成员，其人数已从二人扩增至六人。第二个创新是另一个委员会的诞生，成员由大会议抽签选出，职责是提名总督。虽然人选必须经由公民大会批准，但因为只提名一人，所以实际上是把推选总督的大权交给这个委员会。第三个创新是新总督必须选读限制其权力的就职誓词。这些限制后来持续扩增，以至于后来的总督必须服从地方法官，然后演变到所有决定必须由总督委员会批准。总督委员会也扮演确保总督遵守大会议所有决定的角色。
这些政治改革导致一连串进一步的制度创新：在法律方面是创造独立的地方法官、法院、上诉法院，和新的民间契约与破产法。这些新的威尼斯经济制度允许创造新的合法企业形式和新类型的契约。金融的创新速度很快，我们看到的现代银行业务大约从此时的威尼斯萌芽。威尼斯朝向完全广纳式制度迈进的力量似乎难以抵挡。
但所有这一切都存在着某种紧张关系。威尼斯广纳式制度支持的经济成长伴随着创造性破坏，借由康曼达契约或类似的经济制度致富的每一波新兴年轻企业家，往往会减损既有菁英的获利或经济成功。而且这批新人不仅会减损既有菁英的获利，还会挑战他们的政治权力。因此对大会议里的既有菁英来说，永远有一种诱惑驱使他们关闭新人进入政治体系的通道。
在大会议创始之初，成员资格是每年决定一次。就我们的了解，每到年底会随机选出四名提名委员，由他们负责提名一百名会议成员，被提名者将自动当选为新任大会议成员。1286年10月3日，大会议有一项提案建议修改规定，被提名的候选人必须获得四十人会议的多数确认，而四十人会议是由菁英家族牢牢控制的。这将赋予这群菁英否决大会议新成员的权力，是一项前所未有的扩权。该提案未获通过。1286年10月5
日，又有另一项提案提出，这次的提案通过了。此后如果被提名者的父亲或祖父曾担任大会议成员，他就可以自动确认当选，否则必须获得总督委员会确认。10月17日又通过一项修改，规定大会议成员的人选必须经由四十人会议、总督和总督委员会批准。
1286年的辩论和制度修改预告了威尼斯的“关闭”（La Serrata）。1297年2月，新的规定是，如果你曾在过去四年担任大会议成员，就能自动获得提名和批准。新提名人选现在必须获得四十人会议批准，但只有十二人有投票权。1298年9月11日以后，现任成员和他们的家人再也不需要确认。大会议现在实际上已向外人关闭，既有的成员已变成世袭贵族。贵族的头衔在1315年确定，记载在威尼斯贵族的官方名册《金书》
（Libro d’Oro）上。

形成中的贵族圈外的人并未轻易放弃他们的权力。从1297年到1315年 间，威尼斯的政治紧张持续升高，大会议的一部分反应是让自己变大。为了安抚最激烈的反对者，大会议把成员从四百五十人扩增到一千五百人。大会议的扩张伴随着压制。1310年首度建立常备警力，国内的高压统治也逐渐升高，无疑是为了巩固新的政治秩序。
完成政治关闭后，大会议接着采取经济关闭的行动。转向榨取式政治制度后，紧接着是转向榨取式经济制度。最重要的是，他们禁止使用康曼达契约这项让威尼斯变富裕的重大制度创新。这不应该让人意外：康曼达契约让新商人获益，而既有的菁英现在想排除他们。这只是步向更具榨取性的制度的一步。另一步是，从1314年起，威尼斯政府开始接管贸易，实施贸易国有化。它建立国家船队从事贸易，从1324年开始对想从事贸易的个人征收重税。长程贸易变成贵族的专利。这是威尼斯繁荣结束的开始。几种主要事业被人数越来越少的菁英垄断后，衰退于是开 始。威尼斯似乎已来到变成第一个广纳式社会的边缘，却在一场政变中倒下。政治和经济制度变得更具榨取性，威尼斯开始陷入经济衰退。到 1500年，人口已萎缩到十万人。从1650年到1800年这段欧洲人口快速增长的时期，威尼斯人口不增反减。
今日威尼斯仅有的经济除了一点渔业外，就只有旅游业。威尼斯人不再开创贸易路线和经济制度，而是为成群结队的外国人制作披萨和冰淇淋，以及吹制彩色玻璃。游客前来欣赏“关闭”前的威尼斯奇景，例如总督宫和圣马可大教堂的铜马，这些铜马是威尼斯统治地中海时从拜占庭劫掠来的。威尼斯从经济强权变成了博物馆。

本章我们将专注于讨论世界各地的制度的发展，并解释为什么它们以不同的方式演进。我们在第四章看到西欧的制度与东欧的分歧发展，以及英格兰的制度又如何与西欧其他国家愈见分歧。这种现象是制度微小差异的结果，主要源自制度漂移和关键时期的交互作用。因此我们可能忍不住认为，这些制度差异只是更深的历史冰山的一角，在水线之下我们会发现，英格兰和欧洲的制度基于几千年来的历史事件而难以抗拒地漂离其他地方的制度。如他们所说，其余的则是历史。
然而实际并非如此，这有两个理由。第一，从我们谈到的威尼斯可见，迈向广纳式制度的措施可能被反转。威尼斯虽然一度繁荣富裕，但它们的政治和经济制度被推翻，富裕也随之反转。今日威尼斯的富裕是因为在别的地方赚钱的人，选择把钱花在瞻仰威尼斯过去的光荣上。广纳式制度可能反转的事实显示，制度进步没有单纯的累积过程。
第二，在关键时期扮演重要角色的制度微小差异，本质上就是短暂的。由于是小差异，它们可以被反转，然后可能再度出现，并且再度被反 转。我们将在本章讨论到，与地理或文化理论的说法相反，在17世纪广纳式制度迈出决定性步伐的英格兰是一个落后地区，不仅在中东新石器革命后的几千年间落后，在西罗马帝国崩溃后中世纪开始时也是如此。不列颠群岛对罗马帝国是边陲地区，毫无疑问比西欧大陆、北非和巴尔干半岛、君士坦丁堡和中东都不重要。西罗马帝国在公元五世纪崩溃后，英格兰出现最严重的衰退。但最终带来工业革命的政治革命不是发生在意大利、土耳其甚至西欧大陆，而是出现在不列颠群岛。
要了解同向英国工业革命的路途和其他追随工业革命的国家，罗马的遗绪仍有其重要性，这有几个原因：第一，罗马和威尼斯一样，初期曾经历重大的制度创新。就像威尼斯，罗马初期的经济成功建基在广纳式制度上——至少以当时的标准而言。就像威尼斯，这些制度后来变得愈来愈具有榨取性。在罗马的情况，这是从共和（公元前510年到公元前49年）转变成帝国（公元前49年到公元476年）。虽然在共和期间罗马建立了宏伟的帝国，长程贸易和运输欣欣向荣，但大部分罗马经济仍以榨取为基础。从共和转变成帝国提高了榨取，最后导致类似我们从玛雅城邦看到的内斗、不稳定和崩溃。
第二也是更重要的一点是，我们将讨论到西欧后来的制度发展，虽然它不是直接继承自罗马，却是西罗马帝国崩溃后这个地区普遍的关键时期的后果。世界其他部分如非洲、亚洲或美洲当时都未出现类似的关键时期，不过我们也会通过埃塞俄比亚的历史谈到，当世界的其他部分经历类似的关键时期，这些地方的反应方式有时候会十分类似。罗马崩溃导致封建制度形成，而封建制度的副产品之一是奴隶制度式微，促使不在
 
君王和贵族影响力范围之内的城市开始出现，并在这个过程中创造了一套统治者政治权力被削弱的制度。黑死病就是在这种封建基础上带来一场浩劫，并进一步强化了独立城市和农民的地位，减损君王、贵族和大地主的权势。就是在这种背景下，大西洋贸易创造的机会开始发挥影响力。世界的许多部分并未经历这种转变，其结果是彼此逐渐漂离。

"""

params = VideoParameter(content=text,
                        # qr_url="https://north-path.it-t.xyz",
                        # icon_path="resources/icon/android-chrome-192x192.png"
                        background_music="resources/background_music/Undercover Vampire.mp3"
                        )

generate_video(params)

