from context.Context import VideoParameter
from llm.llm_client import get_llm_client
from service.main_process import generate_video

text ="""
津巴布韦、索马里及塞拉利昂，都是非洲贫穷国家的典型，或许亚洲也不乏其例。难道拉丁美洲国家就没有失灵的政府吗？难道他们的总统就不至于厚颜无耻到诈中乐透吗？
在哥伦比亚，安第斯山脉往北逐渐与一大块濒临加勒比海的海岸平原合一，哥伦比亚人称这里为“热乡”，有别于安第斯山的“寒乡“。过去五十五年来，多数政治学者及国家都把哥伦比亚视为一个民主国家。对于这个国家，美国不仅乐于与之签订自由贸易协定，而且给予各方面的援 助，特别是军事援助。哥伦比亚曾经经历过短暂的军事统治，1958年之后，选举定期举行，尽管在1974年以前，该国两个传统政党——保守党与自由党——曾经签署协定，同意轮流执政及担任总统。但不管怎么说，此一协定——国民阵线——毕竟经过哥伦比亚人民公投核准，其为民主似无疑义。
然而，哥伦比亚虽然拥有长久的民主选举历史，却没有广纳式制度。相反的，其历史充斥着妨碍公民自由、私刑处决、对平民施暴以及内战的污点，跟我们期待的民主政治结果大相径庭。内战在塞拉利昂造成政府与社会的瓦解，国家陷入极大的混乱，在哥伦比亚虽然不同，但它仍然是一场内战，而且造成了更大的伤亡。1950年代的军事统治本身就是一场西班牙文名之为”暴力“的内战产物，从此以后，层出不穷的叛乱团 体，多数为共产革命分子，荼毒乡村，从事绑架与谋杀。在哥伦比亚乡村，如果想要免于这两种灾难，就必须”接种疫苗“，意思就是每个月向武装暴徒缴付保护费，换取绑架及谋杀的免疫。
中国驻哥伦比亚使馆于2011年6月8日证实，中国中化集团下属哥伦比亚 Emerald公司4名中国员工当天在哥伦比亚南部被武装分子绑架。哥伦比亚被称为“贩毒王园”，也是世界闻名的“绑票之国”。据悉，此次绑架中国工人事件系该国最大反政府武装“哥伦比亚革命武装力量”所为。
哥伦比亚的武装团体并非全都是共产主义者。1981年哥伦比亚主要的共产党游击团体哥伦比亚革命武装部队，在热乡安提欧吉亚省东北方一个名叫阿玛菲的小镇绑架了一名农民杰苏•卡斯塔诺，要求支付七千五百美元赎金，这在哥伦比亚农村算是一笔不小的钱。家人抵押农地筹足款项，但最后还是替被链子绑在树上的父亲收尸。卡斯塔诺的三个儿子，卡洛斯、费代尔及范森忍无可忍，成立了一个自卫组织洛坦格洛追杀革命武装部队成员复仇。三兄弟善于组织，不久，随着自己的团体扩大，便开始与其他志同道合的类似准军事团体合作。左派游击队肆虐，因而有敌对的右派自卫组织兴起，哥伦比亚许多地区均饱受其害。自卫组织通常是地主用来防卫游击队的武力，但也涉入毒品运输、勒索、绑架及谋杀。
哥伦比亚联合自卫军女杀手玛丽莲。 玛丽莲在2004年10月被自己的组织处决，原因很简单：她的新男友是位政府军士兵，而她的组织与政府军翻脸了。玛丽莲被组织标准处决叛徒方式处决：乱石击打，然后击毙，痛苦地结束了25岁零2个月的生命。
1997年，卡斯塔洛兄弟领导的自卫组织成立了一个全国性的自卫组织，哥伦比亚联合自卫队。联合自卫队势力扩及全国各地，特别是热乡的科尔多巴省、苏克里省、玛格达列拉省及西撒省。到2001年，联合自卫队手下可供调派的武装人员多达三万，而且将组织打入了不同领域。科尔多巴有一个自卫组织布洛克卡塔通博，领导人是萨尔瓦多•曼库索。随着力量的成长，联合自卫队做了一个重要的决策，准备涉入政治。自卫组织与政治人物之间互有所需。联合自卫队的几名领导人筹备了一次会议，在科尔多巴省的圣塔非的拉多里与重要的政治人物会面，发表了一份联合文件，一项协定，呼吁”国家重建“，参与签署的人士包括联合自卫队的领导成员，诸如”乔治四十“、帕兹及维西诺，以及政治人物，诸如国家参议员孟提斯及埃斯皮里拉。到了这个阶段，联合自卫队的势力已经遍及哥伦比亚，对他们来说，拿下2002年的众议院及参议院选举乃是轻而易举的事。举例来说，在苏克里省的圣奥诺夫里自治市，选举就是自我组织领袖卡德纳操盘。一个目击者描述所见到的情况：
“卡德纳派遣的卡车四出，前往圣奥诺夫里附近的乡镇及农村地区载人。根据居民的说法……数百名农民为了2002年的选举被载到普兰帕里佐镇，让他们认识参加国会选举候选人的长相，包括选参议员的莫勒诺及选众议员的里巴洛。
卡德纳把市议会议员的名字都放进一个袋子，然后拿出两个说，如果里巴洛没选上，这两个人以及其他随便挑出来的人都得死。“
威胁显然奏效，两个候选人在整个苏克里都得到了四万票。无疑的，圣奥诺夫里市长也签署了圣塔菲的拉力多协定。2002年的选举中，大概有三分之一的众议员及参议员是靠自卫组织的支持当选，自卫组织在哥伦比亚控制的地区有多广，从地图20就可以看出一个大概。曼库索在一次访问中自己也招认：
“有自卫组织的省份选出来的国会议员占35%，在这些省份，收税的人是我们，伸张正义的是我们，我们有军队，控制地方上的土地，所有想要从政的人都必须来跟我们派在那里的代表打招呼商量。“
由此不难想象，在经济体系和公共政策上，自卫组织对政治及社会的影响。联合自卫队的扩张并不是一件和平的事。这个团体不单是对抗哥伦比亚革命武装部队而已，他们也杀害无辜的平民百姓，恐吓驱赶成千上万人致使其流离失所。根据挪威难民理事会的境内流离失所者监测中心统计，2010年初，哥伦比亚人口中大约有10%，约四百五十万人流离失所。此外，诚如曼库索所说，自卫组织根本就接管了政府及其一切职 能，唯一例外的是，所收的税全进了他们自己的口袋。自卫组织领袖蓝诺斯与陶拉米那、阿瓜祖尔、玛尼、维拉鲁耶瓦、蒙特利及沙巴那加拉等市的市长都签订了特别协定，下列由”卡山那尔农民自卫组织“所订定的规则，市长必须遵守：”9.市政预算的50%由自卫组织管理。
10.	市政当局所签订的每份合约10要给付（于卡山那尔农民自卫组织）。
11.	义务协助卡山那尔农民自卫组织所召开之所有集会。
12.	每一项基础建设计划均应包括卡山那尔农民自卫组织。
13.	加入卡山那尔农民自卫组织所组织的新政党。
14.	完成他/她的治理计划。“
卡山那尔并不是一个贫穷省份，相反的，该省的人均收入高于哥伦比亚其他任何省份，因为该省拥有油田，自卫组织觊觎的也正是这项资源。事实上，一旦大权在握，他们马上有系统地加强地产的搜刮，以曼库索为例，累积城市与乡村地产价值就高达二千五百万美元。据估计，自卫组织在哥伦比亚搜刮的土地多达全国农村土地的十分之一。
以哥伦比亚来说，虽然还不算是一个行将崩溃的失灵政府，却是一个政治集权不足，政令无法完全行于其领土的政府。尽管在大城市地区如波哥大及巴兰基亚仍能提供治安及公共服务，但在大部分乡下地区，不仅少有公共服务之提供，而且法纪几乎荡然，而是由另类的势力及个人
——如曼库索——当家作主，控制政治及资源。整个国家一分为二，部分地区拥有高水平的人力资源及创业能力，但在别的地方，制度却是榨取式的，政府甚至连最起码的权威都没有。
像这样一种情况，竟然还能维持数十年至数百年，或许很难理解。但事实上，这种情况做为一种恶性循环，自有其本身的逻辑。动乱以及缺乏集权的政府体制，与运作社会不同功能面向的政治人物进入一种共生关系。在法治不彰的乡下地区，政治人物大肆搜刮，而政府又放任自卫组织团体予取予求，如此一来，共生关系形成。
这种模式在2000年代尤其显著。2002年，乌里贝当选总统。这位新总统有某些地方与卡斯塔诺兄弟类似，父亲也遭到革命武装部队杀害，竞选的主要政见之一就是反对前任政府与革命武装部队媾和。在2002年的选举中，在自卫组织控制的地区，他的得票高出其他地区三个百分点。到了2006年，他在这些地区的得票更高出11%。曼库索及其同伙既然能够在参众两院的选举中操纵选票，在总统选举中当然也做得到，更何况他们是在支持一个与他们有共同看法，对他们可能也比较宽大的总统。所以，2005年9月，曼库索的副手、联合自卫队西努及圣乔治兵团的前首脑安格力塔就宣布，他非常荣幸为”有史以来最好的总统竞选连任“效 力。
一旦连任成功，自卫组织的参议院及众议员便在国会中全力配合乌里贝的要求，特别是在修宪方面，使他能够在2006年再度竞选连任——而这在他第一次任期中则是遭到否决的。为了投桃报李，乌里贝总统发布了一项宽大为怀的法令，准许自卫组织复员。所谓复员并不是遣散自卫组织，而是让其在哥伦比亚大部分地区及自卫组织控制的地区制度化，使其得以继续存在下去。
随着时间的推移，哥伦比亚的经济及政治制度在许多方面都已经愈趋广纳，但某些严重的榨取式制度仍然存在。这个国家绝大部分地方，法治不彰及财产权没有保障已经成了地方上的宿疾，之所以会如此，其症结则在于许多地区国家政府根本管不到，以及哥伦比亚缺乏中央集权的政府形式。但这种情形并不是不可避免的。它本身乃是恶性循环的结果：哥伦比亚的政治制度没有为政治人物制造诱因，让他们愿意为国家提供公共服务及治安，也没有足够的约束力阻止他们与自卫组织及黑帮进行或明或暗的勾结。

"""

params = VideoParameter(content=text,
                        # qr_url="https://north-path.it-t.xyz",
                        # icon_path="resources/icon/android-chrome-192x192.png"
                        background_music="resources/background_music/Drone in D.mp3"
                        )

generate_video(params)

