from context.Context import VideoParameter
from service.main_process import generate_video


# generate_video()


text = """
大温哥华房市回暖：销量激增，价格趋稳
大温哥华地区10月份的房市出现了强劲的反弹，房屋销量较去年同期增长超过30%，这表明市场正在逐渐回暖。大温哥华地产经纪协会（GVR）的最新数据显示，10月份通过MLS®系统售出的住宅数量为2,632套，同比增长31.9%。虽然这一数字仍然比过去十年的季节性平均水平低5.5%，但这无疑是一个积极的信号。

市场表现亮点

销售激增： 抵押贷款利率的连续下调吸引了更多买家入市，成交量因此显著上升。GVR经济数据分析总监Andrew Lis表示，购房需求的回暖是预料之中的事。利率下降降低了购房成本，促使更多潜在买家开始行动，这直接带动了房屋销量的增长。
新上市数量增加： 10月份新上市的住宅数量为5,452套，较去年增长16.9%，比过去十年的平均水平高出20%。这表明更多卖家开始将房屋投入市场，市场供应正在逐步增加。
总房源数量增加： MLS®系统上活跃房源的数量为14,477套，同比增长24.8%，比过去十年的平均水平高出26.2%。供应量的增加意味着买家拥有更多选择，也意味着市场竞争会更加激烈。
销售-活跃房源比率

10月份各类房产的销售-活跃房源比率为18.8%，其中独立屋为13.4%，联排和公寓分别为22.5%和22.2%。一般而言，若比率持续低于12%，房价面临下行压力；若超20%，房价则有上行压力。目前大温哥华地区的销售-活跃房源比率整体处于一个比较平衡的水平，但联排和公寓市场已逐步偏向卖方，房价上涨的可能性更大。

价格走势

综合基准价： 大温哥华住宅综合基准价为$1,172,200，同比下降1.9%，环比下降0.6%。虽然整体价格有所下降，但下降幅度已经开始放缓，表明价格下跌的趋势正在减弱。
独立屋： 销量724套，同比增加25.5%，基准价为$2,002,900，同比微增0.3%。独立屋市场表现较为强劲，销量和价格都出现了增长，这可能与独立屋的稀缺性和投资价值有关。
公寓： 销量1,393套，同比上升33.4%，基准价$757,200，同比下降1.6%。公寓市场表现同样抢眼，销量大幅增长，但价格仍然有所下降，这可能是受到市场整体价格走势的影响。
联排住宅： 销量501套，同比上涨40.7%，基准价$1,108,800，同比上涨0.4%。联排住宅市场表现尤为突出，销量和价格都有明显的增长，这可能与联排住宅的性价比和舒适性有关。
总结

10月份强劲的销量为市场带来了复苏的迹象，但GVR提醒，单月数据不足以判断长期趋势。目前市场保持平衡，联排与公寓市场逐步偏向卖方，价格趋稳但波动仍可能继续。随着利率的持续下降和市场需求的回升，预计未来大温哥华地区的房市将继续保持稳定发展。
"""

params = VideoParameter(content=text)

generate_video(params)

