from context.Context import VideoParameter
from service.main_process import generate_video

text = """
加拿大十年签证新政：探亲旅游都受影响！
从昨晚开始，各类社交平台就公布了加拿大签证的最新改革，网友们都炸了！加拿大从几个月前就开始收紧各类政策，现在又轮到了临时居民。真的是说变就变，没有一点征兆，本来说是限制临时居民，现在直接卡断十年旅游签。

加拿大移民、难民和公民事务部（IRCC）官网昨日发布了最新签证签发指令的项目更新。这项简短公告主要用来通知IRCC内部员工政策更新，相关内容也会公布在官网上，方便利益相关者参考。

公告中指出，多次入境签证的最长有效期将不再作为标准时间。签证官员在签发签证时，可能会选择给出有效期短于最长有效期的签证（最长时间为10年，或护照或生物识别的有效期限，以其中较早的为准）。此外，签证官员也可以根据情况选择发放单次或多次入境的签证。

换句话说，从2024年11月6日起，加拿大移民部门在处理访客签证（包括旅游、商务和探亲）时，将不再默认给予最长10年、无限制入境的多次往返签证，而是可能限制其有效期和入境次数。

签证官将根据具体情况，自行决定是签发单次入境还是多次入境签证，并设定合适的有效期限。

还有很多网友比较焦虑，正在申请或者已经递交材料的会不会受到影响。

未来来加拿大旅游的申请人可能只能获得单次入境签证。现阶段尚未明确这一政策是否会影响正在审理中的签证申请，而已获签的签证预计不受影响。

另一方面，对于入境生娃的人来说，尽管加拿大移民法规中并没有限制孕妇入境，但是签证官可以用“担心孕妇身体条件，可能无法安全返回中国”为由拒绝其十年签证申请。如果孕妇为了顺利过签隐瞒自己已经怀孕的事实，那就是违法，被查出会受到5年禁止入境的惩罚。

虽然目前看来，加拿大10年签证短时间内不可能彻底取消，但是加拿大政府已经提出要通过海关限制、提高拒签率，以及入籍法改革，全面避免10年签证遭滥用。

根据官网更新内容，签证官员在决定发放单次还是多次入境签证时，需考量以下因素：

访问的具体目的
资金能力
健康状况
以及其他因素（他国旅行经历、拒签史等）
来源：IRCC
"""

params = VideoParameter(content=text, qr_url="https://north-path.it-t.xyz",
                        icon_path="resources/icon/android-chrome-192x192.png")

generate_video(params)
