from context.Context import VideoParameter
from llm.llm_client import get_llm_client
from service.main_process import generate_video

text ="""

“二元经济”的典型最初由刘易斯爵士于1955年提出，至今许多社会科学家思考低度开发国家的经济问题时，仍然是从这个角度切入。按照刘易斯的说法，许多低度开发国家的经济都是二元结构，其一为现代部门，另一为传统部门。现代部门相当于经济中发展得较高的部分，与之相关的如都市生活、现代产业及先进技术的应用。与传统部门相关的则是农村生活、农业，以及“落后的”制度及技术。落后的农业制度包括土地所有权公有，这表示私人没有土地财产权。按照刘易斯的观点，在传统部门，劳动力的使用非常没有效率，大可将之重新配置，转用到现代部 门，这样做也不至于降低农业部门的生产量。好几个世代下来，发展经济学者无不以刘易斯的观点为依归，所谓“发展问题”，无法就是把人和资源从传统部门、农业及农村转移给现代部门、工业及都市。1979年，刘易斯因经济发展理论获诺贝尔奖。
以他的理论为基础，刘易斯和发展经济学者所指出的二元经济，确实有其道理。南非就是最明显的例子，一是传统部门，落后而贫穷，一是现代部门，活跃而繁荣。时至今日，二元经济在这里仍然到处可见。若要见识这种状况，最好的办法莫过于开车到夸祖鲁—纳塔尔省与特兰斯凯省的边界去走一趟。边界沿着大凯河而行。纳塔尔境内的河东，沿海所见，尽是滨海高档房屋，沙滩绵延，景致优雅。内陆则是甘蔗园，绿意遍野。道路美不胜收，整个地区散发着富裕的气息。但一过了河，仿佛就进入了另外一个时代和国家，触目荒凉。放眼大地，四野褐黄，不见绿意。自来水、卫生间，以及现代豪宅的一切现代设施，全都消失，人们所住，无非简陋的草寮，炊煮都在露天。生活当然是传统的，跟河东比起来，相差可谓十万八千里。目睹此一情景，一河之隔的差异，系于两岸经济制度的大不同，这也就不足为奇了。
河东的纳塔尔，人民拥有私有财产权、运作良好的法律体系、市场、商业化农业，以及工业。但在河西的特兰斯凯，直到最近仍然是土地公 有，部族首领大权在握，唯我独尊。通过刘易斯二元经济的理论之镜，特兰斯凯与纳塔尔之间的对比充分说明了非洲的发展问题。事实上，更进一步观察发现，就历史来说，整个非洲其实和特兰斯凯如出一辙，无非是贫穷加上前现代的经济制度、落后的技术及部族首领统治。按照这个看法，只要经济发展了，特兰斯凯应该也能够变成纳塔尔。
但此一看似成理的观点却忽略了一点，亦即二元经济之存在及其与现代经济的关系之间自有其逻辑。特兰斯凯的落后并非完全是非洲本土落后的历史残余。特兰斯凯与纳塔尔之间的二元经济其实是相当晚近的事，绝非原来就存在的，而是南非白人菁英阶层刻意打造出来，其目的无非是要为他们自己的事业制造一个廉价劳动的储备库，并以此降低非洲黑人的竞争力。因此，二元经济的低度发展乃是人为造就的有一个例子，而不是低度发展乃自然发生并持续多个世纪的例子。
南非与博茨瓦纳就避免了奴隶贸易以及为此引发战争的不利效应，这一点本书稍后将会谈到。荷兰东印度公司1625年在泰泊湾（现在的开普 敦）建立基地，是南非人与欧洲人的第一次重要互动。当时，南非西部人口稀少，多数人以狩猎采集为生，人称科伊科伊人。偏东的部分则是今天的西斯凯及特兰斯凯，为人口密集的农业社会。刚开始时，这些非洲人与新来的荷兰殖民者互动并不频繁，也与奴隶的贸易无关。南非沿海地区距离奴隶市场遥远，西斯凯及特兰斯凯的居民，亦即廓萨人，则地处内陆深处，都未引起太多的注意。因此，横扫西非及中非的倒退发展并未波及此一地区。
到19世纪，这些地方的封闭开始有了改变。对于南非的气候及环境，欧洲人开始发生兴趣。西非地处热带，热带疾病如霍乱及黄热病，使大部分的非洲变成了“白人的坟场”，欧洲人不仅不愿意定居，甚至不愿意设置永久的驻地。南非却不同，不仅气候温和，而且完全没有霍乱及黄热病这类热带疾病，比较适合欧洲人定居。拿破仑战争期间，英国从荷兰人手上夺下开普敦之后，欧洲向南非内陆的扩张于是展开，随着开拓不断朝内地深入，引发了一连串的长期战争，是为廓萨之战。1835年，欧洲人之深入南非内地达到高潮。当时，荷兰裔欧洲人，亦即后来的欧洲
 裔南非人或布尔人，展开集体迁移，史称“大迁徙”，迁离英国控制下的沿海及开普敦地区，后来在非洲内陆建立了两个独立国家，一为奥兰治自由国，一为特兰斯瓦。
1867年，金伯利发现巨大钻石矿藏，1886年，约翰内斯堡发现丰富金 矿，南非开发的第二阶段随之展开。巨大的矿产财富使英国大为心动，决心全面占领整个南非。奥兰治自由国和特兰斯瓦起而抵抗，导致1880至1881年及1899至1902年著名的布尔战争。最初虽然失利，英国终究将欧洲裔南非人国家的版图并入了开普省与纳塔尔，1910年成立南非联邦。矿产经济的发展与欧洲人的大举扩张，除了引发布尔人与英国人之间的战争外，对此一地区的发展另有其他的意义，其中最值得注意的是，他们因此制造了粮食及其他农业产品的需求，进而在农业及贸易上为非洲原住民制造了新的机会。
根据历史学家邦迪所收录的文献，对于此一经济机会，西斯凯及特兰斯凯的廓萨人很快就做出回应。早在1832年，甚至矿业尚未起飞前，这些地区新生的经济活力，特兰斯凯一位摩拉维亚教会传教士就已经看在眼里，同时也注意到，对于欧洲人带来的新消费商品，非洲人也产生了需求。他写道：“为了要得到这些东西，他们用自己的双手付出劳力，赚取金钱，购买衣服、铲子、犁头、车辆及其他有用的商品。”
民政专员海明1876年走访西斯凯的芬格埔，所做的描述同样传神：
“芬格人短短几年间的进步非常之大，令我十分惊讶……茅草屋子、砖造或石造的居所全都有模有样，无论走到哪里都看得到。许多地方盖起了颇具规模的砖房……种植了水果树；不管哪里，只要有溪水可用，引水耕地便到哪里；丘陵山坡甚至高山顶上，只要犁头可到之处，无不耕遍。翻耕土地之广，令人惊讶；耕地如此广大，多年未见。”
如同下撒哈拉非洲的其他部分，在农业上，犁的使用虽属新事，但只要给他们机会，非洲农民很快就能接受新的技术，并在车辆及灌溉方面做好投资准备。
随着农业经济的发展，僵化死板的部落制度也开始让路。许多证据显示，土地财产权出现了改变。1879年，东格里克兰的昂金谷鲁的地方行政官这样写道：“原住民想要拥有土地的欲望愈来愈强烈，他们已经买了三万八千亩地。”三年之后，他又写道，区内约有八千个非洲农民买了九万亩地，并开始在其上耕作。
说到工业革命，非洲或许言之过早，但真正的改变却已经上路。土地私有弱化了部族首领的地位，使一般人也能够购买土地生财，这在数十年前根本是无法想象的事。这也充分显示，榨取式制度及专制体系的衰落很快就能带来新的经济活力。这中间成功的故事非常多，西斯凯的桑杰卡只是其中之一而已。1911年，这位白手起家的农民在一次演说中指 出，他第一次向父亲开口说要买土地时，父亲回答说：“买土地？你怎么会想到要买土地呢？所有的土地都属于神，祂也只赐给酋长，这你难道不知道？”桑杰卡父亲的反应是可以理解的。但桑杰卡不气馁，他到威廉国王镇去找了一份工作，说道：
“用了一点手腕，到银行开了一个私人账户，把一笔储蓄存了进去……一直存到八十镑……（买了）一只牛，连带轭、犁、工具及其他农具……又买了一小块田……至于我的乡亲，我并不十分建议他们也从事农耕……但不管怎么说，总要用现代的法子去赚点钱才是正途。”

卫理公会传教士戴维斯1869年写的一封信，最可以见出这个时代非洲农民的活力与富裕。在这封寄到英格兰的信中，他喜不自胜地说，他为“兰开夏郡棉花救济基金”募集到了四十六英镑现金。这个时代，富裕的非洲农民可以捐钱救济贫穷的英国纺织工人。
一点也不令人惊讶的是，这种经济活力惹恼了传统的酋长，在他们眼 里，这是我们已经熟悉的模式，这简直就是在侵犯他们的财富与权力。 1879年，特兰斯凯地方行政长官布莱斯注意到，有人反对测量土地，因为唯有这样才能将土地分割成为私有财产。他的记述写道：“有些部族首领……反对，但多数人都乐观其成……部族首领都明白，承认个人的名分地位，有损他们部族首领的威望。”
部族首领也抗拒土地改良，诸如挖掘灌溉沟渠或建筑围篱。他们明白，这些改良措施只不过是个人拥有土地财产权的前奏，那也就是他们自己末日的开始。欧洲观察家甚至注意到，部族首领以及其他传统权威人 士，譬如巫医，就企图禁止所有的“欧洲花样”，包括新的种子、犁之类的工具，以及各种商品。但随着西斯凯与特兰斯凯并入英国殖民政府，传统的部族首领与权威人士一蹶不振，再也无法阻挡新的经济活力在南非兴起。1884年在芬格埔，一名欧洲观察家指出：
“老百姓转而向我们效忠。酋长变成一种地主头衔……不再有政治权力。酋长……巫医的嫉妒发作起来，足以致命，容不下富有的牛只主人、能干的谋士、新商品的引进、技术高超的农业专家，因为这一切都会使他们沦落为凡夫；然而，芬格人不再顾忌这些……他们是进步人 士。尽管仍然是一介农夫……他却有车有犁，开渠灌溉，并拥有一大群绵羊。”
广纳式制度，加上部族首领权力的衰退，纵使只是星星之火，却足以在非洲引发沛然的经济繁荣。但好景不长。1890年至1913年间，一切戛然而止，进入了倒退。这段期间，两股力量合流，过去五十年非洲人创造的农村财富与活力随之尽付东流。其一是欧洲农民与非洲人竞争所引发的对抗。由于非洲农民的成功，欧洲人所生产的同类谷物价格跟着下 降。对此，欧洲人做出的回应是将非洲人逐出市场。第二股力量更为邪恶。欧洲人需要廉价劳工以供刚兴起的矿业所用，为了确保此一目标的实现，就只有把非洲人贫穷化。于是，接下去的数十年，此一策略便按部就班地执行。
1897年，矿业协会理事长奥布在调查委员会作证，对贫穷化非洲人以得到廉价劳工的做法提出了有力的描述。他说，他“对那些下人什么都不必说，只要告诉他们减薪就成了”。他的证词如下：
委员会：假定有卡菲尔（指非洲黑人）辞职不干回牛棚去了呢？你赞成要求政府强迫他们出来做工吗？
奥布：当然……我会断然采取强迫……为什么要让一个黑鬼游手好闲呢？依我的看法，应该强迫他们工作以养活自己。
委员会：如果工人不工作也能生活，你又怎么强迫他工作呢？
奥布：征他的税，然后……
委员会：所以你不会让卡菲尔在乡下拥有土地，却必须为白人工作让他发财？
奥布：帮助邻人，那是他应该做的。

扫除白人农民的竞争对手，开发大规模的廉价劳动力，双管齐下，1913年随着原住民土地法的立法，两大目标同时完成。此一法案预言了刘易斯二元经济的概念，把南非一分为二，一是现代的富裕部门，一是传统的贫穷部门这项法案除了落实贫富的二分外，同时规定，87%的土地都交给只占人口20%的欧洲人，剩下的13%才归于南非黑人。当然，在这项法案之前，早已经有了许多前例，欧洲人一直都在限制非洲人，将他们保有的土地愈圈愈小。但直到1913年法案定案，整个形势才制度化，也为南非的种族隔离制度设下了舞台，从此政治与经济的权利全归少数白人，黑人虽为多数，却是两者皆空。法案特别规定，保留某些土地，包括特兰斯凯与西斯凯，做为非洲人的“原乡”。后来这些地方成为所谓的班图斯坦，也成了南非种族隔离制度的另一个借口，说什么南非黑人并不是这一地区的原住民，而是班图人后裔，是一千多年前从东尼日利亚迁移过来的。如此一来，讲到对这片土地的权利，他们不见得比欧洲人多，实际上当然还更少。
，1913年的土地法及其1936年的修正案分配给南非黑人的土地实在少得可怜。此外，此图也可以看出1970年类似的土地分配也发生在津巴布韦，是另一个二元经济体的建立。这一部分我们将在第十三章再做讨论。
1913年的立法还包括了一些条款，旨在阻止小佃农及流动农民在白人拥有的土地上耕作，顶多只能短期打工。负责原住民事务的书记说
明：“法案的目的在于终止未来任何涉及欧洲人与原住民之间有关土地及土地收成的交易行为，所有与原住民签订的新合约都必须是工作合 约。所有这类秉持诚心签订的合约，雇主当初于善意不计一切给付原住民，或特准其耕种指定的一块土地……但原住民不得给付主人任何东西以换取占有土地的权利。”


1950年代与60年代，发展经济学正在成形，刘易斯的理论也正走红，对当时走访南非的发展经济学家来说，原乡经济与白人富裕的现代经济之间形成强烈对比，正是二元经济理论所讨论的核心。经济中属于欧洲人的部分是都市的、受过教育的，使用的是现代技术。原乡则是贫穷的、乡村的及落后的，劳动生产力极低，人民未受过教育，落后如故，仿佛完全没有受到时间的影响。
但撇开这些不谈，二元经济并非自然发生，也不是不可避免，而是欧洲殖民主义的产物。没错，原乡是贫穷的，技术上是落后的，人民没有受过教育。但始作俑者却是政府的政策。政府强势打压非洲的经济成长，以便欧洲人所控制的矿场及土地制造没有受过教育的廉价劳工。1913年之后，白人侵占非洲人的土地，大量非洲人被迫离乡背井，涌入原乡，却又因空间太小，不足以让他们养活自己。一如所料，在这种情况下，他们只能廉价出卖自己的劳动力，到白人的公司去找一口饭吃。随着经济动机的瓦解，之前五十年所成就的进步全都退回原点。耕田时放弃了犁，重新拾起锄头，当然，那还得他们有地可耕。更常见的情形是，只能委身做个廉价劳工，而那正是当初划定原乡所要达到的目的。
事实上，毁掉的不只是经济动机而已，已经开始的政治变化也转而倒 退。之前，部族首领及传统统治者的力量已经式微，如今却死灰复燃，因为制造廉价劳工的阳谋得逞，土地私有财产制胎死腹中。于是部落首领的土地控制权重新获得认可。1951年，政府通过班图人管理机构法，所有这些措施乃达到最高点。早在1940年，范德利就已经明白点出了此一问题：
“部落的保有权，无异于保证土地永远无法得到适当的使用，也永远无法属于原住民。要有廉价的劳工，就要有一个廉价的繁殖场，所以这是以非洲人自己做为代价。”
土地遭到剥夺，导致非洲农民陷入赤贫，不仅为落后的经济打造了制度基础，而且还制造了穷人塞满这个经济。
1913年原住民土地法实施之后，原乡生活水平倒退，证据信手可得。特兰斯凯与西斯凯陷入经济衰退，持续不断。历史学家威尔森从金矿公司那里搜集到的雇佣资料显示，整个南非经济的衰退非常广泛。继土地法及其他立法之后，1911至1921年之间，矿工的薪资下降达30%。到1961年，尽管南非的经济维持相当稳定的成长，但相较于1911年，薪资反而下降了12%。这段期间，南非无疑是全世界最不公平的国家。
 但话又说回来，尽管环境如此，在欧洲人的现代经济中，非洲黑人难道就不能走自己的道路，开始自己的事业，或者接受教育力争上游吗？答案是，政府的作为让所有这些事情都不会发生。在欧洲人的经济势力范围内——87%的土地——所有的黑人都不准拥有财产或经营事业。种族隔离政权清楚得很，让黑人受教育只会使他们成为白人的竞争者，而不会为矿业或白人拥有的农业提供廉价劳工。早在1904年，矿业界就实施了一套制度，为欧洲人保留工作权，举凡搅拌水泥的工人、试金人、矿坑监工、锻工、锅炉工、铜匠、铜铸工、泥水匠……长长一份清单，没完没了，一直到木匠，全都不准黑人担任。总而言之，在矿业界，黑人禁止从事任何技术性工作。这就是恶名昭彰的“有色人种障碍”（color bar），为南非政权所发明的各项种族隔离措施开了先例。1926年，有色人种障碍扩及全部经济活动，直到1980年代。黑人没受教育一点也不令人惊讶。南非政府不仅排除任何在经济上有利于黑人的教育，同时还拒绝投资黑人学校，压抑黑人教育。此一政策于1950年代达到高峰，当时，在种族隔离政策主要策划者维沃尔德带领下，政府通过了班图人教育法。此一法案背后的哲学，维沃尔德在1954年的一次演讲中，毫不避讳地公诸于世：
“班图人必须弄清楚，无论在哪一方面，他都只能在自己的社会里做
事。在欧洲人的社会里，高于某些层面的工作，他是没份的……因此，接受一种训练以便投入欧洲人社会这种事情，于他是没有需要的，更何况，他既不能也不会被欧洲人社会吸收。”
当然，维沃尔德口中的二元经济显然大不同于刘易斯的二元经济理论。在南非，二元经济并不是发展过程不可避免的结果，而是政府制造出来的产物。在南非，穷人不可能随着经济发展从落后部门晋身到现代部 门。相反的，反而是落后部门的存在促成了现代部门的成功，利用非技术性黑人劳工的廉价工资，白人获得了巨大的利益。按照刘易斯的看法，出身传统部门的非技术工人将会逐渐变成受过教育的技术性劳工。但在南非，此一过程完全不存在。事实上，黑人劳工停留在非技术层面，并被禁止担任高阶技术的职位，完全是出于故意，其目的无非是要让有技术的白人劳工不致遭到竞争并继续享受高薪。在南非，黑人完全“困处”于原乡，困处于传统经济。但这并不是有利于发展的经济成长所造成的问题。白人的发展靠的是原乡。
在白人以剥削黑人为基础所建立的榨取式制度下，南非的经济发展模式到头来成就有限，其实一点也不令人意外。南非白人拥有财产权，他们投资教育，又能够开采黄金及钻石，以高利润出售到世界市场。但高达 80%的人民却遭到边缘化，令人称羡的经济活动绝大部分都把他们排除在外。生为黑人，有天资也没用，完全不可能成为技术性工人、商人、企业家、工程师或科学家。经济制度是榨取式的，白人靠榨取黑人致 富。的确，南非白人拥有西方欧洲国家相同的生活水平，但南非黑人呢？比起下撒哈拉非洲的那些人民，他们一点也不富有，同样一贫如洗。没有创造性的破坏，这种光是肥了白人的经济成长，只要黄金和钻石的收入增加便可以继续不断。然而，到了1970年代，经济停止成长了。
同样不令人意外的是，这套榨取式经济制度是建立在一套高度榨取式的政治制度上。1994年垮台之前，南非政治制度把一切的权力都交到白人手上，只有白人才能投票及竞选公职。白人支配警察、军队及所有的政府机构，而这些机构又置于白人的军事统治之下。1910年南非联邦成立时，奥兰治自由国与德兰斯瓦等政治实体就已经是彻头彻尾的种族特 权，完全禁止黑人参与政治。殖民地纳塔尔与开普虽然准许黑人投票，但前提是他们必须拥有足够的财产，而这明显是他们无法做到的。1910年时，殖民地纳塔尔与开普任然维持原有制度，但到了1930年代，南非境内所有的地方，黑人的投票权完全遭到剥夺。
1994年，南非的二元经济告终，但不是基于刘易斯爵士的理论所提出的原因。结束有色人种障碍与原乡的并非经济发展的自然过程。一个政权既不承认人民的基本权利又不同他们分享经济成长的利得，南非的黑人终于起而抗争。1976年索威托起义之后，抗争行动愈来愈有组织，也愈来愈强大，最后终于打倒了这个种族隔离国家。南非黑人集结奋起所凝聚的力量，终于终结了南非的二元经济，同样也终结了南非白人从一开始就制造了这种经济模式的政治力量。

"""

params = VideoParameter(content=text,
                        # qr_url="https://north-path.it-t.xyz",
                        # icon_path="resources/icon/android-chrome-192x192.png"
                        background_music="resources/background_music/Drone in D.mp3"
                        )

generate_video(params)

