from context.Context import VideoParameter
from service.main_process import generate_video

text = """
川普连任对加拿大的影响
2020年美国大选结果出炉，特朗普成功连任，这对于北美的邻居加拿大来说意味着什么呢？

根据最新的民调数据，加拿大民众对特朗普连任的反应褒贬不一，部分人认为特朗普的连任将会对加拿大经济产生负面影响，而另一些人则认为特朗普的连任将会为加拿大带来新的机遇。

特朗普的经济政策一直以来都备受争议，他的“美国优先”政策，强调保护美国本土产业和就业，这对加拿大经济的影响很大。例如，特朗普曾对加拿大铝和钢铁征收关税，导致加拿大制造业遭受损失。而特朗普连任后，预计他会继续推行这一政策，这将进一步冲击加拿大经济。

除了经济方面，特朗普连任还将影响加拿大的移民政策。特朗普在第一任期内已经收紧了移民政策，而他连任后，预计他会继续收紧移民政策，这将会给加拿大吸引人才带来挑战。

总的来说，特朗普连任对加拿大经济和移民政策的影响是复杂的，既有挑战，也有机遇。加拿大政府需要做好准备，应对特朗普连任带来的各种挑战，同时也要抓住新的机遇，促进加拿大经济发展。

以下是一些专家对特朗普连任对加拿大的影响的分析：

贸易方面
特朗普在竞选期间承诺对所有美国进口商品征收10%的关税，这对加拿大来说无疑是一个沉痛打击。目前加拿大的制造业要么是美资企业加拿大分公司，要么是依托北美自贸协定出口到美国做二道贩子。特朗普的政策将会导致加拿大的制造业竞争力下降，不少企业可能会选择关闭或者将生产线迁往其他国家。
投资方面
特朗普连任后预计会继续降低企业税，这可能会导致美国公司将投资和业务转移回美国，给加拿大带来经济损失。同时，加拿大也需要吸引更多的外资投资，以保持经济增长。
移民政策方面
特朗普连任后预计会继续收紧移民政策，这可能会导致更多人才选择移民到其他国家，而不是加拿大。加拿大需要制定更加灵活的移民政策，吸引更多优秀的人才。
房价方面
特朗普在第一任期内的政策导致加拿大房价出现了下跌。专家预计，如果特朗普继续推行“美国优先”政策，加拿大的房价可能会继续下跌。对于打算买房的华人来说，需要谨慎考虑。
总的来说，特朗普连任对加拿大的影响是多方面的，加拿大政府需要做好准备，应对各种挑战，同时也要抓住新的机遇。

当然，这仅仅是专家对特朗普连任对加拿大的影响的一些分析，实际情况可能会更加复杂。无论如何，加拿大政府需要做好准备，应对特朗普连任带来的各种挑战，同时也要抓住新的机遇，促进加拿大经济发展。
"""

params = VideoParameter(content=text, qr_url="https://north-path.it-t.xyz",
                        icon_path="resources/icon/android-chrome-192x192.png")

generate_video(params)
